{
    "Block": {
        "minecraft": [
            "acacia_button",
            "acacia_door",
            "acacia_fence",
            "acacia_fence_gate",
            "acacia_hanging_sign",
            "acacia_leaves",
            "acacia_log",
            "acacia_planks",
            "acacia_pressure_plate",
            "acacia_sapling",
            "acacia_sign",
            "acacia_slab",
            "acacia_stairs",
            "acacia_trapdoor",
            "acacia_wall_hanging_sign",
            "acacia_wall_sign",
            "acacia_wood",
            "activator_rail",
            "air",
            "allium",
            "amethyst_block",
            "amethyst_cluster",
            "ancient_debris",
            "andesite",
            "andesite_slab",
            "andesite_stairs",
            "andesite_wall",
            "anvil",
            "attached_melon_stem",
            "attached_pumpkin_stem",
            "azalea",
            "azalea_leaves",
            "azure_bluet",
            "bamboo",
            "bamboo_block",
            "bamboo_button",
            "bamboo_door",
            "bamboo_fence",
            "bamboo_fence_gate",
            "bamboo_hanging_sign",
            "bamboo_mosaic",
            "bamboo_mosaic_slab",
            "bamboo_mosaic_stairs",
            "bamboo_planks",
            "bamboo_pressure_plate",
            "bamboo_sapling",
            "bamboo_sign",
            "bamboo_slab",
            "bamboo_stairs",
            "bamboo_trapdoor",
            "bamboo_wall_hanging_sign",
            "bamboo_wall_sign",
            "barrel",
            "barrier",
            "basalt",
            "beacon",
            "bedrock",
            "bee_nest",
            "beehive",
            "beetroots",
            "bell",
            "big_dripleaf",
            "big_dripleaf_stem",
            "birch_button",
            "birch_door",
            "birch_fence",
            "birch_fence_gate",
            "birch_hanging_sign",
            "birch_leaves",
            "birch_log",
            "birch_planks",
            "birch_pressure_plate",
            "birch_sapling",
            "birch_sign",
            "birch_slab",
            "birch_stairs",
            "birch_trapdoor",
            "birch_wall_hanging_sign",
            "birch_wall_sign",
            "birch_wood",
            "black_banner",
            "black_bed",
            "black_candle",
            "black_candle_cake",
            "black_carpet",
            "black_concrete",
            "black_concrete_powder",
            "black_glazed_terracotta",
            "black_shulker_box",
            "black_stained_glass",
            "black_stained_glass_pane",
            "black_terracotta",
            "black_wall_banner",
            "black_wool",
            "blackstone",
            "blackstone_slab",
            "blackstone_stairs",
            "blackstone_wall",
            "blast_furnace",
            "blue_banner",
            "blue_bed",
            "blue_candle",
            "blue_candle_cake",
            "blue_carpet",
            "blue_concrete",
            "blue_concrete_powder",
            "blue_glazed_terracotta",
            "blue_ice",
            "blue_orchid",
            "blue_shulker_box",
            "blue_stained_glass",
            "blue_stained_glass_pane",
            "blue_terracotta",
            "blue_wall_banner",
            "blue_wool",
            "bone_block",
            "bookshelf",
            "brain_coral",
            "brain_coral_block",
            "brain_coral_fan",
            "brain_coral_wall_fan",
            "brewing_stand",
            "brick_slab",
            "brick_stairs",
            "brick_wall",
            "bricks",
            "brown_banner",
            "brown_bed",
            "brown_candle",
            "brown_candle_cake",
            "brown_carpet",
            "brown_concrete",
            "brown_concrete_powder",
            "brown_glazed_terracotta",
            "brown_mushroom",
            "brown_mushroom_block",
            "brown_shulker_box",
            "brown_stained_glass",
            "brown_stained_glass_pane",
            "brown_terracotta",
            "brown_wall_banner",
            "brown_wool",
            "bubble_column",
            "bubble_coral",
            "bubble_coral_block",
            "bubble_coral_fan",
            "bubble_coral_wall_fan",
            "budding_amethyst",
            "cactus",
            "cake",
            "calcite",
            "calibrated_sculk_sensor",
            "campfire",
            "candle",
            "candle_cake",
            "carrots",
            "cartography_table",
            "carved_pumpkin",
            "cauldron",
            "cave_air",
            "cave_vines",
            "cave_vines_plant",
            "chain",
            "chain_command_block",
            "cherry_button",
            "cherry_door",
            "cherry_fence",
            "cherry_fence_gate",
            "cherry_hanging_sign",
            "cherry_leaves",
            "cherry_log",
            "cherry_planks",
            "cherry_pressure_plate",
            "cherry_sapling",
            "cherry_sign",
            "cherry_slab",
            "cherry_stairs",
            "cherry_trapdoor",
            "cherry_wall_hanging_sign",
            "cherry_wall_sign",
            "cherry_wood",
            "chest",
            "chipped_anvil",
            "chiseled_bookshelf",
            "chiseled_deepslate",
            "chiseled_nether_bricks",
            "chiseled_polished_blackstone",
            "chiseled_quartz_block",
            "chiseled_red_sandstone",
            "chiseled_sandstone",
            "chiseled_stone_bricks",
            "chorus_flower",
            "chorus_plant",
            "clay",
            "coal_block",
            "coal_ore",
            "coarse_dirt",
            "cobbled_deepslate",
            "cobbled_deepslate_slab",
            "cobbled_deepslate_stairs",
            "cobbled_deepslate_wall",
            "cobblestone",
            "cobblestone_slab",
            "cobblestone_stairs",
            "cobblestone_wall",
            "cobweb",
            "cocoa",
            "command_block",
            "comparator",
            "composter",
            "conduit",
            "copper_block",
            "copper_ore",
            "cornflower",
            "cracked_deepslate_bricks",
            "cracked_deepslate_tiles",
            "cracked_nether_bricks",
            "cracked_polished_blackstone_bricks",
            "cracked_stone_bricks",
            "crafting_table",
            "creeper_head",
            "creeper_wall_head",
            "crimson_button",
            "crimson_door",
            "crimson_fence",
            "crimson_fence_gate",
            "crimson_fungus",
            "crimson_hanging_sign",
            "crimson_hyphae",
            "crimson_nylium",
            "crimson_planks",
            "crimson_pressure_plate",
            "crimson_roots",
            "crimson_sign",
            "crimson_slab",
            "crimson_stairs",
            "crimson_stem",
            "crimson_trapdoor",
            "crimson_wall_hanging_sign",
            "crimson_wall_sign",
            "crying_obsidian",
            "cut_copper",
            "cut_copper_slab",
            "cut_copper_stairs",
            "cut_red_sandstone",
            "cut_red_sandstone_slab",
            "cut_sandstone",
            "cut_sandstone_slab",
            "cyan_banner",
            "cyan_bed",
            "cyan_candle",
            "cyan_candle_cake",
            "cyan_carpet",
            "cyan_concrete",
            "cyan_concrete_powder",
            "cyan_glazed_terracotta",
            "cyan_shulker_box",
            "cyan_stained_glass",
            "cyan_stained_glass_pane",
            "cyan_terracotta",
            "cyan_wall_banner",
            "cyan_wool",
            "damaged_anvil",
            "dandelion",
            "dark_oak_button",
            "dark_oak_door",
            "dark_oak_fence",
            "dark_oak_fence_gate",
            "dark_oak_hanging_sign",
            "dark_oak_leaves",
            "dark_oak_log",
            "dark_oak_planks",
            "dark_oak_pressure_plate",
            "dark_oak_sapling",
            "dark_oak_sign",
            "dark_oak_slab",
            "dark_oak_stairs",
            "dark_oak_trapdoor",
            "dark_oak_wall_hanging_sign",
            "dark_oak_wall_sign",
            "dark_oak_wood",
            "dark_prismarine",
            "dark_prismarine_slab",
            "dark_prismarine_stairs",
            "daylight_detector",
            "dead_brain_coral",
            "dead_brain_coral_block",
            "dead_brain_coral_fan",
            "dead_brain_coral_wall_fan",
            "dead_bubble_coral",
            "dead_bubble_coral_block",
            "dead_bubble_coral_fan",
            "dead_bubble_coral_wall_fan",
            "dead_bush",
            "dead_fire_coral",
            "dead_fire_coral_block",
            "dead_fire_coral_fan",
            "dead_fire_coral_wall_fan",
            "dead_horn_coral",
            "dead_horn_coral_block",
            "dead_horn_coral_fan",
            "dead_horn_coral_wall_fan",
            "dead_tube_coral",
            "dead_tube_coral_block",
            "dead_tube_coral_fan",
            "dead_tube_coral_wall_fan",
            "decorated_pot",
            "deepslate",
            "deepslate_brick_slab",
            "deepslate_brick_stairs",
            "deepslate_brick_wall",
            "deepslate_bricks",
            "deepslate_coal_ore",
            "deepslate_copper_ore",
            "deepslate_diamond_ore",
            "deepslate_emerald_ore",
            "deepslate_gold_ore",
            "deepslate_iron_ore",
            "deepslate_lapis_ore",
            "deepslate_redstone_ore",
            "deepslate_tile_slab",
            "deepslate_tile_stairs",
            "deepslate_tile_wall",
            "deepslate_tiles",
            "detector_rail",
            "diamond_block",
            "diamond_ore",
            "diorite",
            "diorite_slab",
            "diorite_stairs",
            "diorite_wall",
            "dirt",
            "dirt_path",
            "dispenser",
            "dragon_egg",
            "dragon_head",
            "dragon_wall_head",
            "dried_kelp_block",
            "dripstone_block",
            "dropper",
            "emerald_block",
            "emerald_ore",
            "enchanting_table",
            "end_gateway",
            "end_portal",
            "end_portal_frame",
            "end_rod",
            "end_stone",
            "end_stone_brick_slab",
            "end_stone_brick_stairs",
            "end_stone_brick_wall",
            "end_stone_bricks",
            "ender_chest",
            "exposed_copper",
            "exposed_cut_copper",
            "exposed_cut_copper_slab",
            "exposed_cut_copper_stairs",
            "farmland",
            "fern",
            "fire",
            "fire_coral",
            "fire_coral_block",
            "fire_coral_fan",
            "fire_coral_wall_fan",
            "fletching_table",
            "flower_pot",
            "flowering_azalea",
            "flowering_azalea_leaves",
            "frogspawn",
            "frosted_ice",
            "furnace",
            "gilded_blackstone",
            "glass",
            "glass_pane",
            "glow_lichen",
            "glowstone",
            "gold_block",
            "gold_ore",
            "granite",
            "granite_slab",
            "granite_stairs",
            "granite_wall",
            "grass",
            "grass_block",
            "gravel",
            "gray_banner",
            "gray_bed",
            "gray_candle",
            "gray_candle_cake",
            "gray_carpet",
            "gray_concrete",
            "gray_concrete_powder",
            "gray_glazed_terracotta",
            "gray_shulker_box",
            "gray_stained_glass",
            "gray_stained_glass_pane",
            "gray_terracotta",
            "gray_wall_banner",
            "gray_wool",
            "green_banner",
            "green_bed",
            "green_candle",
            "green_candle_cake",
            "green_carpet",
            "green_concrete",
            "green_concrete_powder",
            "green_glazed_terracotta",
            "green_shulker_box",
            "green_stained_glass",
            "green_stained_glass_pane",
            "green_terracotta",
            "green_wall_banner",
            "green_wool",
            "grindstone",
            "hanging_roots",
            "hay_block",
            "heavy_weighted_pressure_plate",
            "honey_block",
            "honeycomb_block",
            "hopper",
            "horn_coral",
            "horn_coral_block",
            "horn_coral_fan",
            "horn_coral_wall_fan",
            "ice",
            "infested_chiseled_stone_bricks",
            "infested_cobblestone",
            "infested_cracked_stone_bricks",
            "infested_deepslate",
            "infested_mossy_stone_bricks",
            "infested_stone",
            "infested_stone_bricks",
            "iron_bars",
            "iron_block",
            "iron_door",
            "iron_ore",
            "iron_trapdoor",
            "jack_o_lantern",
            "jigsaw",
            "jukebox",
            "jungle_button",
            "jungle_door",
            "jungle_fence",
            "jungle_fence_gate",
            "jungle_hanging_sign",
            "jungle_leaves",
            "jungle_log",
            "jungle_planks",
            "jungle_pressure_plate",
            "jungle_sapling",
            "jungle_sign",
            "jungle_slab",
            "jungle_stairs",
            "jungle_trapdoor",
            "jungle_wall_hanging_sign",
            "jungle_wall_sign",
            "jungle_wood",
            "kelp",
            "kelp_plant",
            "ladder",
            "lantern",
            "lapis_block",
            "lapis_ore",
            "large_amethyst_bud",
            "large_fern",
            "lava",
            "lava_cauldron",
            "lectern",
            "lever",
            "light",
            "light_blue_banner",
            "light_blue_bed",
            "light_blue_candle",
            "light_blue_candle_cake",
            "light_blue_carpet",
            "light_blue_concrete",
            "light_blue_concrete_powder",
            "light_blue_glazed_terracotta",
            "light_blue_shulker_box",
            "light_blue_stained_glass",
            "light_blue_stained_glass_pane",
            "light_blue_terracotta",
            "light_blue_wall_banner",
            "light_blue_wool",
            "light_gray_banner",
            "light_gray_bed",
            "light_gray_candle",
            "light_gray_candle_cake",
            "light_gray_carpet",
            "light_gray_concrete",
            "light_gray_concrete_powder",
            "light_gray_glazed_terracotta",
            "light_gray_shulker_box",
            "light_gray_stained_glass",
            "light_gray_stained_glass_pane",
            "light_gray_terracotta",
            "light_gray_wall_banner",
            "light_gray_wool",
            "light_weighted_pressure_plate",
            "lightning_rod",
            "lilac",
            "lily_of_the_valley",
            "lily_pad",
            "lime_banner",
            "lime_bed",
            "lime_candle",
            "lime_candle_cake",
            "lime_carpet",
            "lime_concrete",
            "lime_concrete_powder",
            "lime_glazed_terracotta",
            "lime_shulker_box",
            "lime_stained_glass",
            "lime_stained_glass_pane",
            "lime_terracotta",
            "lime_wall_banner",
            "lime_wool",
            "lodestone",
            "loom",
            "magenta_banner",
            "magenta_bed",
            "magenta_candle",
            "magenta_candle_cake",
            "magenta_carpet",
            "magenta_concrete",
            "magenta_concrete_powder",
            "magenta_glazed_terracotta",
            "magenta_shulker_box",
            "magenta_stained_glass",
            "magenta_stained_glass_pane",
            "magenta_terracotta",
            "magenta_wall_banner",
            "magenta_wool",
            "magma_block",
            "mangrove_button",
            "mangrove_door",
            "mangrove_fence",
            "mangrove_fence_gate",
            "mangrove_hanging_sign",
            "mangrove_leaves",
            "mangrove_log",
            "mangrove_planks",
            "mangrove_pressure_plate",
            "mangrove_propagule",
            "mangrove_roots",
            "mangrove_sign",
            "mangrove_slab",
            "mangrove_stairs",
            "mangrove_trapdoor",
            "mangrove_wall_hanging_sign",
            "mangrove_wall_sign",
            "mangrove_wood",
            "medium_amethyst_bud",
            "melon",
            "melon_stem",
            "moss_block",
            "moss_carpet",
            "mossy_cobblestone",
            "mossy_cobblestone_slab",
            "mossy_cobblestone_stairs",
            "mossy_cobblestone_wall",
            "mossy_stone_brick_slab",
            "mossy_stone_brick_stairs",
            "mossy_stone_brick_wall",
            "mossy_stone_bricks",
            "moving_piston",
            "mud",
            "mud_brick_slab",
            "mud_brick_stairs",
            "mud_brick_wall",
            "mud_bricks",
            "muddy_mangrove_roots",
            "mushroom_stem",
            "mycelium",
            "nether_brick_fence",
            "nether_brick_slab",
            "nether_brick_stairs",
            "nether_brick_wall",
            "nether_bricks",
            "nether_gold_ore",
            "nether_portal",
            "nether_quartz_ore",
            "nether_sprouts",
            "nether_wart",
            "nether_wart_block",
            "netherite_block",
            "netherrack",
            "note_block",
            "oak_button",
            "oak_door",
            "oak_fence",
            "oak_fence_gate",
            "oak_hanging_sign",
            "oak_leaves",
            "oak_log",
            "oak_planks",
            "oak_pressure_plate",
            "oak_sapling",
            "oak_sign",
            "oak_slab",
            "oak_stairs",
            "oak_trapdoor",
            "oak_wall_hanging_sign",
            "oak_wall_sign",
            "oak_wood",
            "observer",
            "obsidian",
            "ochre_froglight",
            "orange_banner",
            "orange_bed",
            "orange_candle",
            "orange_candle_cake",
            "orange_carpet",
            "orange_concrete",
            "orange_concrete_powder",
            "orange_glazed_terracotta",
            "orange_shulker_box",
            "orange_stained_glass",
            "orange_stained_glass_pane",
            "orange_terracotta",
            "orange_tulip",
            "orange_wall_banner",
            "orange_wool",
            "oxeye_daisy",
            "oxidized_copper",
            "oxidized_cut_copper",
            "oxidized_cut_copper_slab",
            "oxidized_cut_copper_stairs",
            "packed_ice",
            "packed_mud",
            "pearlescent_froglight",
            "peony",
            "petrified_oak_slab",
            "piglin_head",
            "piglin_wall_head",
            "pink_banner",
            "pink_bed",
            "pink_candle",
            "pink_candle_cake",
            "pink_carpet",
            "pink_concrete",
            "pink_concrete_powder",
            "pink_glazed_terracotta",
            "pink_petals",
            "pink_shulker_box",
            "pink_stained_glass",
            "pink_stained_glass_pane",
            "pink_terracotta",
            "pink_tulip",
            "pink_wall_banner",
            "pink_wool",
            "piston",
            "piston_head",
            "pitcher_crop",
            "pitcher_plant",
            "player_head",
            "player_wall_head",
            "podzol",
            "pointed_dripstone",
            "polished_andesite",
            "polished_andesite_slab",
            "polished_andesite_stairs",
            "polished_basalt",
            "polished_blackstone",
            "polished_blackstone_brick_slab",
            "polished_blackstone_brick_stairs",
            "polished_blackstone_brick_wall",
            "polished_blackstone_bricks",
            "polished_blackstone_button",
            "polished_blackstone_pressure_plate",
            "polished_blackstone_slab",
            "polished_blackstone_stairs",
            "polished_blackstone_wall",
            "polished_deepslate",
            "polished_deepslate_slab",
            "polished_deepslate_stairs",
            "polished_deepslate_wall",
            "polished_diorite",
            "polished_diorite_slab",
            "polished_diorite_stairs",
            "polished_granite",
            "polished_granite_slab",
            "polished_granite_stairs",
            "poppy",
            "potatoes",
            "potted_acacia_sapling",
            "potted_allium",
            "potted_azalea_bush",
            "potted_azure_bluet",
            "potted_bamboo",
            "potted_birch_sapling",
            "potted_blue_orchid",
            "potted_brown_mushroom",
            "potted_cactus",
            "potted_cherry_sapling",
            "potted_cornflower",
            "potted_crimson_fungus",
            "potted_crimson_roots",
            "potted_dandelion",
            "potted_dark_oak_sapling",
            "potted_dead_bush",
            "potted_fern",
            "potted_flowering_azalea_bush",
            "potted_jungle_sapling",
            "potted_lily_of_the_valley",
            "potted_mangrove_propagule",
            "potted_oak_sapling",
            "potted_orange_tulip",
            "potted_oxeye_daisy",
            "potted_pink_tulip",
            "potted_poppy",
            "potted_red_mushroom",
            "potted_red_tulip",
            "potted_spruce_sapling",
            "potted_torchflower",
            "potted_warped_fungus",
            "potted_warped_roots",
            "potted_white_tulip",
            "potted_wither_rose",
            "powder_snow",
            "powder_snow_cauldron",
            "powered_rail",
            "prismarine",
            "prismarine_brick_slab",
            "prismarine_brick_stairs",
            "prismarine_bricks",
            "prismarine_slab",
            "prismarine_stairs",
            "prismarine_wall",
            "pumpkin",
            "pumpkin_stem",
            "purple_banner",
            "purple_bed",
            "purple_candle",
            "purple_candle_cake",
            "purple_carpet",
            "purple_concrete",
            "purple_concrete_powder",
            "purple_glazed_terracotta",
            "purple_shulker_box",
            "purple_stained_glass",
            "purple_stained_glass_pane",
            "purple_terracotta",
            "purple_wall_banner",
            "purple_wool",
            "purpur_block",
            "purpur_pillar",
            "purpur_slab",
            "purpur_stairs",
            "quartz_block",
            "quartz_bricks",
            "quartz_pillar",
            "quartz_slab",
            "quartz_stairs",
            "rail",
            "raw_copper_block",
            "raw_gold_block",
            "raw_iron_block",
            "red_banner",
            "red_bed",
            "red_candle",
            "red_candle_cake",
            "red_carpet",
            "red_concrete",
            "red_concrete_powder",
            "red_glazed_terracotta",
            "red_mushroom",
            "red_mushroom_block",
            "red_nether_brick_slab",
            "red_nether_brick_stairs",
            "red_nether_brick_wall",
            "red_nether_bricks",
            "red_sand",
            "red_sandstone",
            "red_sandstone_slab",
            "red_sandstone_stairs",
            "red_sandstone_wall",
            "red_shulker_box",
            "red_stained_glass",
            "red_stained_glass_pane",
            "red_terracotta",
            "red_tulip",
            "red_wall_banner",
            "red_wool",
            "redstone_block",
            "redstone_lamp",
            "redstone_ore",
            "redstone_torch",
            "redstone_wall_torch",
            "redstone_wire",
            "reinforced_deepslate",
            "repeater",
            "repeating_command_block",
            "respawn_anchor",
            "rooted_dirt",
            "rose_bush",
            "sand",
            "sandstone",
            "sandstone_slab",
            "sandstone_stairs",
            "sandstone_wall",
            "scaffolding",
            "sculk",
            "sculk_catalyst",
            "sculk_sensor",
            "sculk_shrieker",
            "sculk_vein",
            "sea_lantern",
            "sea_pickle",
            "seagrass",
            "shroomlight",
            "shulker_box",
            "skeleton_skull",
            "skeleton_wall_skull",
            "slime_block",
            "small_amethyst_bud",
            "small_dripleaf",
            "smithing_table",
            "smoker",
            "smooth_basalt",
            "smooth_quartz",
            "smooth_quartz_slab",
            "smooth_quartz_stairs",
            "smooth_red_sandstone",
            "smooth_red_sandstone_slab",
            "smooth_red_sandstone_stairs",
            "smooth_sandstone",
            "smooth_sandstone_slab",
            "smooth_sandstone_stairs",
            "smooth_stone",
            "smooth_stone_slab",
            "sniffer_egg",
            "snow",
            "snow_block",
            "soul_campfire",
            "soul_fire",
            "soul_lantern",
            "soul_sand",
            "soul_soil",
            "soul_torch",
            "soul_wall_torch",
            "spawner",
            "sponge",
            "spore_blossom",
            "spruce_button",
            "spruce_door",
            "spruce_fence",
            "spruce_fence_gate",
            "spruce_hanging_sign",
            "spruce_leaves",
            "spruce_log",
            "spruce_planks",
            "spruce_pressure_plate",
            "spruce_sapling",
            "spruce_sign",
            "spruce_slab",
            "spruce_stairs",
            "spruce_trapdoor",
            "spruce_wall_hanging_sign",
            "spruce_wall_sign",
            "spruce_wood",
            "sticky_piston",
            "stone",
            "stone_brick_slab",
            "stone_brick_stairs",
            "stone_brick_wall",
            "stone_bricks",
            "stone_button",
            "stone_pressure_plate",
            "stone_slab",
            "stone_stairs",
            "stonecutter",
            "stripped_acacia_log",
            "stripped_acacia_wood",
            "stripped_bamboo_block",
            "stripped_birch_log",
            "stripped_birch_wood",
            "stripped_cherry_log",
            "stripped_cherry_wood",
            "stripped_crimson_hyphae",
            "stripped_crimson_stem",
            "stripped_dark_oak_log",
            "stripped_dark_oak_wood",
            "stripped_jungle_log",
            "stripped_jungle_wood",
            "stripped_mangrove_log",
            "stripped_mangrove_wood",
            "stripped_oak_log",
            "stripped_oak_wood",
            "stripped_spruce_log",
            "stripped_spruce_wood",
            "stripped_warped_hyphae",
            "stripped_warped_stem",
            "structure_block",
            "structure_void",
            "sugar_cane",
            "sunflower",
            "suspicious_gravel",
            "suspicious_sand",
            "sweet_berry_bush",
            "tall_grass",
            "tall_seagrass",
            "target",
            "terracotta",
            "tinted_glass",
            "tnt",
            "torch",
            "torchflower",
            "torchflower_crop",
            "trapped_chest",
            "tripwire",
            "tripwire_hook",
            "tube_coral",
            "tube_coral_block",
            "tube_coral_fan",
            "tube_coral_wall_fan",
            "tuff",
            "turtle_egg",
            "twisting_vines",
            "twisting_vines_plant",
            "verdant_froglight",
            "vine",
            "void_air",
            "wall_torch",
            "warped_button",
            "warped_door",
            "warped_fence",
            "warped_fence_gate",
            "warped_fungus",
            "warped_hanging_sign",
            "warped_hyphae",
            "warped_nylium",
            "warped_planks",
            "warped_pressure_plate",
            "warped_roots",
            "warped_sign",
            "warped_slab",
            "warped_stairs",
            "warped_stem",
            "warped_trapdoor",
            "warped_wall_hanging_sign",
            "warped_wall_sign",
            "warped_wart_block",
            "water",
            "water_cauldron",
            "waxed_copper_block",
            "waxed_cut_copper",
            "waxed_cut_copper_slab",
            "waxed_cut_copper_stairs",
            "waxed_exposed_copper",
            "waxed_exposed_cut_copper",
            "waxed_exposed_cut_copper_slab",
            "waxed_exposed_cut_copper_stairs",
            "waxed_oxidized_copper",
            "waxed_oxidized_cut_copper",
            "waxed_oxidized_cut_copper_slab",
            "waxed_oxidized_cut_copper_stairs",
            "waxed_weathered_copper",
            "waxed_weathered_cut_copper",
            "waxed_weathered_cut_copper_slab",
            "waxed_weathered_cut_copper_stairs",
            "weathered_copper",
            "weathered_cut_copper",
            "weathered_cut_copper_slab",
            "weathered_cut_copper_stairs",
            "weeping_vines",
            "weeping_vines_plant",
            "wet_sponge",
            "wheat",
            "white_banner",
            "white_bed",
            "white_candle",
            "white_candle_cake",
            "white_carpet",
            "white_concrete",
            "white_concrete_powder",
            "white_glazed_terracotta",
            "white_shulker_box",
            "white_stained_glass",
            "white_stained_glass_pane",
            "white_terracotta",
            "white_tulip",
            "white_wall_banner",
            "white_wool",
            "wither_rose",
            "wither_skeleton_skull",
            "wither_skeleton_wall_skull",
            "yellow_banner",
            "yellow_bed",
            "yellow_candle",
            "yellow_candle_cake",
            "yellow_carpet",
            "yellow_concrete",
            "yellow_concrete_powder",
            "yellow_glazed_terracotta",
            "yellow_shulker_box",
            "yellow_stained_glass",
            "yellow_stained_glass_pane",
            "yellow_terracotta",
            "yellow_wall_banner",
            "yellow_wool",
            "zombie_head",
            "zombie_wall_head"
        ]
    },
    "BlockTags": {
        "#minecraft": [
            "occludes_vibration_signals",
            "convertable_to_mud",
            "wooden_fences",
            "stone_buttons",
            "infiniburn_overworld",
            "dirt",
            "wolves_spawnable_on",
            "portals",
            "flowers",
            "logs_that_burn",
            "wooden_pressure_plates",
            "spruce_logs",
            "completes_find_tree_tutorial",
            "warped_stems",
            "sculk_replaceable",
            "sniffer_diggable_block",
            "cherry_logs",
            "wooden_trapdoors",
            "lush_ground_replaceable",
            "infiniburn_nether",
            "inside_step_sound_blocks",
            "birch_logs",
            "prevent_mob_spawning_inside",
            "trail_ruins_replaceable",
            "signs",
            "dampens_vibrations",
            "replaceable",
            "climbable",
            "crystal_sound_blocks",
            "iron_ores",
            "stone_ore_replaceables",
            "needs_stone_tool",
            "wall_post_override",
            "acacia_logs",
            "combination_step_sound_blocks",
            "wooden_stairs",
            "enchantment_power_transmitter",
            "cauldrons",
            "emerald_ores",
            "infiniburn_end",
            "mangrove_logs",
            "enchantment_power_provider",
            "coral_plants",
            "bamboo_blocks",
            "dragon_transparent",
            "sniffer_egg_hatch_boost",
            "doors",
            "wooden_doors",
            "fence_gates",
            "replaceable_by_trees",
            "snow_layer_can_survive_on",
            "enderman_holdable",
            "beds",
            "dragon_immune",
            "bamboo_plantable_on",
            "moss_replaceable",
            "dead_bush_may_place_on",
            "polar_bears_spawnable_on_alternate",
            "candle_cakes",
            "bee_growables",
            "cave_vines",
            "wool",
            "needs_iron_tool",
            "underwater_bonemeals",
            "ancient_city_replaceable",
            "goats_spawnable_on",
            "smelts_to_glass",
            "leaves",
            "mineable/pickaxe",
            "ceiling_hanging_signs",
            "flower_pots",
            "overworld_carver_replaceables",
            "vibration_resonators",
            "diamond_ores",
            "geode_invalid_blocks",
            "copper_ores",
            "terracotta",
            "features_cannot_replace",
            "banners",
            "overworld_natural_logs",
            "fences",
            "guarded_by_piglins",
            "redstone_ores",
            "coral_blocks",
            "all_signs",
            "small_flowers",
            "mooshrooms_spawnable_on",
            "nylium",
            "deepslate_ore_replaceables",
            "mineable/hoe",
            "rabbits_spawnable_on",
            "base_stone_overworld",
            "impermeable",
            "soul_fire_base_blocks",
            "maintains_farmland",
            "mineable/axe",
            "slabs",
            "wither_immune",
            "ice",
            "strider_warm_blocks",
            "gold_ores",
            "unstable_bottom_center",
            "shulker_boxes",
            "needs_diamond_tool",
            "lapis_ores",
            "buttons",
            "crops",
            "mangrove_logs_can_grow_through",
            "rails",
            "trapdoors",
            "valid_spawn",
            "frogs_spawnable_on",
            "dripstone_replaceable_blocks",
            "piglin_repellents",
            "stairs",
            "wool_carpets",
            "crimson_stems",
            "wither_summon_base_blocks",
            "wooden_slabs",
            "corals",
            "all_hanging_signs",
            "wall_corals",
            "invalid_spawn_inside",
            "sword_efficient",
            "candles",
            "sand",
            "hoglin_repellents",
            "logs",
            "standing_signs",
            "parrots_spawnable_on",
            "wooden_buttons",
            "frog_prefer_jump_to",
            "mineable/shovel",
            "jungle_logs",
            "stone_bricks",
            "snow",
            "lava_pool_stone_cannot_replace",
            "dark_oak_logs",
            "tall_flowers",
            "fall_damage_resetting",
            "snow_layer_cannot_survive_on",
            "oak_logs",
            "planks",
            "stone_pressure_plates",
            "axolotls_spawnable_on",
            "campfires",
            "azalea_root_replaceable",
            "sculk_replaceable_world_gen",
            "fire",
            "azalea_grows_on",
            "beehives",
            "mangrove_roots_can_grow_through",
            "small_dripleaf_placeable",
            "beacon_base_blocks",
            "saplings",
            "anvil",
            "walls",
            "wall_hanging_signs",
            "animals_spawnable_on",
            "soul_speed_blocks",
            "foxes_spawnable_on",
            "coal_ores",
            "mushroom_grow_block",
            "wart_blocks",
            "nether_carver_replaceables",
            "snaps_goat_horn",
            "wall_signs",
            "pressure_plates",
            "base_stone_nether",
            "big_dripleaf_placeable"
        ],
        "#forge": [
            "glass/black",
            "glass_panes/magenta",
            "ores/iron",
            "ores_in_ground/netherrack",
            "glass_panes/cyan",
            "storage_blocks/diamond",
            "ore_bearing_ground/deepslate",
            "ores/gold",
            "storage_blocks/lapis",
            "glass_panes/light_gray",
            "glass_panes/yellow",
            "stained_glass_panes",
            "glass/blue",
            "storage_blocks/raw_copper",
            "ore_bearing_ground/stone",
            "glass_panes/gray",
            "sand",
            "storage_blocks",
            "glass_panes/black",
            "glass/orange",
            "ore_rates/dense",
            "glass/light_gray",
            "ores/quartz",
            "glass_panes/lime",
            "storage_blocks/redstone",
            "glass_panes/colorless",
            "glass/magenta",
            "stone",
            "glass_panes",
            "glass_panes/white",
            "glass/cyan",
            "storage_blocks/netherite",
            "ores/diamond",
            "ore_bearing_ground/netherrack",
            "glass_panes/green",
            "ores",
            "storage_blocks/gold",
            "end_stones",
            "ores/emerald",
            "glass_panes/orange",
            "glass",
            "chests/wooden",
            "glass/gray",
            "glass_panes/purple",
            "ores/redstone",
            "obsidian",
            "storage_blocks/copper",
            "barrels/wooden",
            "sand/red",
            "glass/colorless",
            "storage_blocks/quartz",
            "fence_gates/wooden",
            "ores/copper",
            "gravel",
            "glass_panes/pink",
            "cobblestone/infested",
            "glass/yellow",
            "ores_in_ground/stone",
            "storage_blocks/raw_gold",
            "storage_blocks/raw_iron",
            "ores/netherite_scrap",
            "ores_in_ground/deepslate",
            "ores/coal",
            "glass/lime",
            "glass/pink",
            "barrels",
            "storage_blocks/iron",
            "storage_blocks/coal",
            "cobblestone/deepslate",
            "sandstone",
            "glass/green",
            "glass/red",
            "fences/wooden",
            "ore_rates/sparse",
            "chests",
            "cobblestone/normal",
            "stained_glass",
            "chests/trapped",
            "glass/light_blue",
            "glass_panes/red",
            "bookshelves",
            "glass/tinted",
            "fences/nether_brick",
            "ores/lapis",
            "glass_panes/light_blue",
            "storage_blocks/emerald",
            "cobblestone",
            "chests/ender",
            "fences",
            "glass_panes/blue",
            "ore_rates/singular",
            "glass_panes/brown",
            "glass/purple",
            "glass/white",
            "glass/silica",
            "storage_blocks/amethyst",
            "fence_gates",
            "enderman_place_on_blacklist",
            "sand/colorless",
            "netherrack",
            "cobblestone/mossy",
            "glass/brown"
        ]
    },
    "Item": {
        "minecraft": [
            "acacia_boat",
            "acacia_chest_boat",
            "allay_spawn_egg",
            "amethyst_shard",
            "angler_pottery_sherd",
            "apple",
            "archer_pottery_sherd",
            "armor_stand",
            "arms_up_pottery_sherd",
            "arrow",
            "axolotl_bucket",
            "axolotl_spawn_egg",
            "baked_potato",
            "bamboo_chest_raft",
            "bamboo_raft",
            "bat_spawn_egg",
            "bee_spawn_egg",
            "beef",
            "beetroot",
            "beetroot_seeds",
            "beetroot_soup",
            "birch_boat",
            "birch_chest_boat",
            "black_dye",
            "blade_pottery_sherd",
            "blaze_powder",
            "blaze_rod",
            "blaze_spawn_egg",
            "blue_dye",
            "bone",
            "bone_meal",
            "book",
            "bow",
            "bowl",
            "bread",
            "brewer_pottery_sherd",
            "brick",
            "brown_dye",
            "brush",
            "bucket",
            "bundle",
            "burn_pottery_sherd",
            "camel_spawn_egg",
            "carrot",
            "carrot_on_a_stick",
            "cat_spawn_egg",
            "cave_spider_spawn_egg",
            "chainmail_boots",
            "chainmail_chestplate",
            "chainmail_helmet",
            "chainmail_leggings",
            "charcoal",
            "cherry_boat",
            "cherry_chest_boat",
            "chest_minecart",
            "chicken",
            "chicken_spawn_egg",
            "chorus_fruit",
            "clay_ball",
            "clock",
            "coal",
            "coast_armor_trim_smithing_template",
            "cocoa_beans",
            "cod",
            "cod_bucket",
            "cod_spawn_egg",
            "command_block_minecart",
            "compass",
            "cooked_beef",
            "cooked_chicken",
            "cooked_cod",
            "cooked_mutton",
            "cooked_porkchop",
            "cooked_rabbit",
            "cooked_salmon",
            "cookie",
            "copper_ingot",
            "cow_spawn_egg",
            "creeper_banner_pattern",
            "creeper_spawn_egg",
            "crossbow",
            "cyan_dye",
            "danger_pottery_sherd",
            "dark_oak_boat",
            "dark_oak_chest_boat",
            "debug_stick",
            "diamond",
            "diamond_axe",
            "diamond_boots",
            "diamond_chestplate",
            "diamond_helmet",
            "diamond_hoe",
            "diamond_horse_armor",
            "diamond_leggings",
            "diamond_pickaxe",
            "diamond_shovel",
            "diamond_sword",
            "disc_fragment_5",
            "dolphin_spawn_egg",
            "donkey_spawn_egg",
            "dragon_breath",
            "dried_kelp",
            "drowned_spawn_egg",
            "dune_armor_trim_smithing_template",
            "echo_shard",
            "egg",
            "elder_guardian_spawn_egg",
            "elytra",
            "emerald",
            "enchanted_book",
            "enchanted_golden_apple",
            "end_crystal",
            "ender_dragon_spawn_egg",
            "ender_eye",
            "ender_pearl",
            "enderman_spawn_egg",
            "endermite_spawn_egg",
            "evoker_spawn_egg",
            "experience_bottle",
            "explorer_pottery_sherd",
            "eye_armor_trim_smithing_template",
            "feather",
            "fermented_spider_eye",
            "filled_map",
            "fire_charge",
            "firework_rocket",
            "firework_star",
            "fishing_rod",
            "flint",
            "flint_and_steel",
            "flower_banner_pattern",
            "fox_spawn_egg",
            "friend_pottery_sherd",
            "frog_spawn_egg",
            "furnace_minecart",
            "ghast_spawn_egg",
            "ghast_tear",
            "glass_bottle",
            "glistering_melon_slice",
            "globe_banner_pattern",
            "glow_berries",
            "glow_ink_sac",
            "glow_item_frame",
            "glow_squid_spawn_egg",
            "glowstone_dust",
            "goat_horn",
            "goat_spawn_egg",
            "gold_ingot",
            "gold_nugget",
            "golden_apple",
            "golden_axe",
            "golden_boots",
            "golden_carrot",
            "golden_chestplate",
            "golden_helmet",
            "golden_hoe",
            "golden_horse_armor",
            "golden_leggings",
            "golden_pickaxe",
            "golden_shovel",
            "golden_sword",
            "gray_dye",
            "green_dye",
            "guardian_spawn_egg",
            "gunpowder",
            "heart_of_the_sea",
            "heart_pottery_sherd",
            "heartbreak_pottery_sherd",
            "hoglin_spawn_egg",
            "honey_bottle",
            "honeycomb",
            "hopper_minecart",
            "horse_spawn_egg",
            "host_armor_trim_smithing_template",
            "howl_pottery_sherd",
            "husk_spawn_egg",
            "ink_sac",
            "iron_axe",
            "iron_boots",
            "iron_chestplate",
            "iron_golem_spawn_egg",
            "iron_helmet",
            "iron_hoe",
            "iron_horse_armor",
            "iron_ingot",
            "iron_leggings",
            "iron_nugget",
            "iron_pickaxe",
            "iron_shovel",
            "iron_sword",
            "item_frame",
            "jungle_boat",
            "jungle_chest_boat",
            "knowledge_book",
            "lapis_lazuli",
            "lava_bucket",
            "lead",
            "leather",
            "leather_boots",
            "leather_chestplate",
            "leather_helmet",
            "leather_horse_armor",
            "leather_leggings",
            "light_blue_dye",
            "light_gray_dye",
            "lime_dye",
            "lingering_potion",
            "llama_spawn_egg",
            "magenta_dye",
            "magma_cream",
            "magma_cube_spawn_egg",
            "mangrove_boat",
            "mangrove_chest_boat",
            "map",
            "melon_seeds",
            "melon_slice",
            "milk_bucket",
            "minecart",
            "miner_pottery_sherd",
            "mojang_banner_pattern",
            "mooshroom_spawn_egg",
            "mourner_pottery_sherd",
            "mule_spawn_egg",
            "mushroom_stew",
            "music_disc_11",
            "music_disc_13",
            "music_disc_5",
            "music_disc_blocks",
            "music_disc_cat",
            "music_disc_chirp",
            "music_disc_far",
            "music_disc_mall",
            "music_disc_mellohi",
            "music_disc_otherside",
            "music_disc_pigstep",
            "music_disc_relic",
            "music_disc_stal",
            "music_disc_strad",
            "music_disc_wait",
            "music_disc_ward",
            "mutton",
            "name_tag",
            "nautilus_shell",
            "nether_brick",
            "nether_star",
            "netherite_axe",
            "netherite_boots",
            "netherite_chestplate",
            "netherite_helmet",
            "netherite_hoe",
            "netherite_ingot",
            "netherite_leggings",
            "netherite_pickaxe",
            "netherite_scrap",
            "netherite_shovel",
            "netherite_sword",
            "netherite_upgrade_smithing_template",
            "oak_boat",
            "oak_chest_boat",
            "ocelot_spawn_egg",
            "orange_dye",
            "painting",
            "panda_spawn_egg",
            "paper",
            "parrot_spawn_egg",
            "phantom_membrane",
            "phantom_spawn_egg",
            "pig_spawn_egg",
            "piglin_banner_pattern",
            "piglin_brute_spawn_egg",
            "piglin_spawn_egg",
            "pillager_spawn_egg",
            "pink_dye",
            "pitcher_pod",
            "plenty_pottery_sherd",
            "poisonous_potato",
            "polar_bear_spawn_egg",
            "popped_chorus_fruit",
            "porkchop",
            "potato",
            "potion",
            "powder_snow_bucket",
            "prismarine_crystals",
            "prismarine_shard",
            "prize_pottery_sherd",
            "pufferfish",
            "pufferfish_bucket",
            "pufferfish_spawn_egg",
            "pumpkin_pie",
            "pumpkin_seeds",
            "purple_dye",
            "quartz",
            "rabbit",
            "rabbit_foot",
            "rabbit_hide",
            "rabbit_spawn_egg",
            "rabbit_stew",
            "raiser_armor_trim_smithing_template",
            "ravager_spawn_egg",
            "raw_copper",
            "raw_gold",
            "raw_iron",
            "recovery_compass",
            "red_dye",
            "redstone",
            "rib_armor_trim_smithing_template",
            "rotten_flesh",
            "saddle",
            "salmon",
            "salmon_bucket",
            "salmon_spawn_egg",
            "scute",
            "sentry_armor_trim_smithing_template",
            "shaper_armor_trim_smithing_template",
            "sheaf_pottery_sherd",
            "shears",
            "sheep_spawn_egg",
            "shelter_pottery_sherd",
            "shield",
            "shulker_shell",
            "shulker_spawn_egg",
            "silence_armor_trim_smithing_template",
            "silverfish_spawn_egg",
            "skeleton_horse_spawn_egg",
            "skeleton_spawn_egg",
            "skull_banner_pattern",
            "skull_pottery_sherd",
            "slime_ball",
            "slime_spawn_egg",
            "sniffer_spawn_egg",
            "snort_pottery_sherd",
            "snout_armor_trim_smithing_template",
            "snow_golem_spawn_egg",
            "snowball",
            "spectral_arrow",
